# DATA FRAME

Pandas Dataframe
Pandas Dataframe is a 2-D data structure like a 2-D array or a table with rows and columns.

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from pandas import Series,DataFrame

In [4]:
df=pd.read_clipboard(engine='python')

In [5]:
df

   OrderID  CustomerID  EmployeeID   OrderDate  ShipperID
0    10308           2           7  1996-09-18          3
1    10309          37           3  1996-09-19          1
2    10310          77           8  1996-09-20          2

In [6]:
OrderID	CustomerID	EmployeeID	OrderDate	ShipperID
10308	2	7	1996-09-18	3
10309	37	3	1996-09-19	1
10310	77	8	1996-09-20	2

SyntaxError: invalid syntax (1109380213.py, line 1)

In [7]:
df.columns

Index(['OrderID', 'CustomerID', 'EmployeeID', 'OrderDate', 'ShipperID'], dtype='object')

In [8]:
df.row

AttributeError: 'DataFrame' object has no attribute 'row'

In [9]:
DataFrame (df,columns=['CustomerID','EmployeeID','OrderDate'])

   CustomerID  EmployeeID   OrderDate
0           2           7  1996-09-18
1          37           3  1996-09-19
2          77           8  1996-09-20

In [10]:
DataFrame (df,columns=['CustomerID','EmployeeID','OrderDate','Product'])

   CustomerID  EmployeeID   OrderDate  Product
0           2           7  1996-09-18      NaN
1          37           3  1996-09-19      NaN
2          77           8  1996-09-20      NaN

In [11]:
df ['Product']='ABC'

In [12]:
df

   OrderID  CustomerID  EmployeeID   OrderDate  ShipperID Product
0    10308           2           7  1996-09-18          3     ABC
1    10309          37           3  1996-09-19          1     ABC
2    10310          77           8  1996-09-20          2     ABC

In [13]:
df['City']='NGP'

In [14]:
DataFrame (df,columns=['CustomerID','EmployeeID','OrderDate','Product','City'])

   CustomerID  EmployeeID   OrderDate Product City
0           2           7  1996-09-18     ABC  NGP
1          37           3  1996-09-19     ABC  NGP
2          77           8  1996-09-20     ABC  NGP

In [15]:
df

   OrderID  CustomerID  EmployeeID   OrderDate  ShipperID Product City
0    10308           2           7  1996-09-18          3     ABC  NGP
1    10309          37           3  1996-09-19          1     ABC  NGP
2    10310          77           8  1996-09-20          2     ABC  NGP

In [16]:
# 0,1,2 are c/as index 
# df = pd.DataFrame(data, index = ["day1", "day2", "day3"])
#here day1, day2, day3 are c/as index

In [17]:
s1=Series(['Tv','Oven','ABC'],index=[0,1,2])

#

In [18]:
s1

0      Tv
1    Oven
2     ABC
dtype: object

In [19]:
df['CustomerID']

0     2
1    37
2    77
Name: CustomerID, dtype: int64

In [20]:
df['Product']=s1

In [21]:
df

   OrderID  CustomerID  EmployeeID   OrderDate  ShipperID Product City
0    10308           2           7  1996-09-18          3      Tv  NGP
1    10309          37           3  1996-09-19          1    Oven  NGP
2    10310          77           8  1996-09-20          2     ABC  NGP

In [22]:
s2=Series(['Chennai','Bangalore','Nagpur'],index=[0,1,2])

In [23]:
df['City']=s2

In [24]:
df

   OrderID  CustomerID  EmployeeID   OrderDate  ShipperID Product       City
0    10308           2           7  1996-09-18          3      Tv    Chennai
1    10309          37           3  1996-09-19          1    Oven  Bangalore
2    10310          77           8  1996-09-20          2     ABC     Nagpur

In [25]:
# the index values defined only will be printed, the not defined one will be printed as"Nan"

In [26]:
df['Quantity']=np.arange(5,16,4)

In [27]:
df

,OrderID,CustomerID,EmployeeID,OrderDate,ShipperID,Product,City,Quantity
0,10308,2,7,1996-09-18,3,Tv,Chennai,5
1,10309,37,3,1996-09-19,1,Oven,Bangalore,9
2,10310,77,8,1996-09-20,2,ABC,Nagpur,13

In [28]:
df.Product[2]

'ABC'

In [29]:
del df['Product']

In [30]:
df

   OrderID  CustomerID  EmployeeID   OrderDate  ShipperID       City  Quantity
0    10308           2           7  1996-09-18          3    Chennai         5
1    10309          37           3  1996-09-19          1  Bangalore         9
2    10310          77           8  1996-09-20          2     Nagpur        13

In [31]:
del df['Quantity']

In [32]:
df

   OrderID  CustomerID  EmployeeID   OrderDate  ShipperID       City
0    10308           2           7  1996-09-18          3    Chennai
1    10309          37           3  1996-09-19          1  Bangalore
2    10310          77           8  1996-09-20          2     Nagpur

In [33]:
df['Product']=Series(['Tv','Oven'],index=(1,2))

In [34]:
df.OrderDate	[2]

'1996-09-20'

In [35]:
df.OrderID[2]

10310

# Loc and iloc

In [39]:
# loc=loc[row-label, column-label]

In [40]:
# loc
# loc[A] or loc[1]
# lo [[A,B]]

In [1]:
#iloc=iloc[row-position, column-position]

In [2]:
#iloc - position based

In [ ]:
#loc - value based

In [42]:
# iloc[1]

In [43]:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [44]:
df.loc["day2"]

calories    380
duration     40
Name: day2, dtype: int64

In [45]:
df.iloc[2]

calories    390
duration     45
Name: day3, dtype: int64

In [46]:
df.loc["day1"]
df.iloc[1]

calories    380
duration     40
Name: day2, dtype: int64

In [48]:
df=pd.read_clipboard(engine='python')

In [49]:
df

   OrderID  CustomerID  EmployeeID   OrderDate  ShipperID
0    10308           2           7  1996-09-18          3
1    10309          37           3  1996-09-19          1
2    10310          77           8  1996-09-20          2

In [50]:
df.loc[2]

OrderID            10310
CustomerID            77
EmployeeID             8
OrderDate     1996-09-20
ShipperID              2
Name: 2, dtype: object

In [53]:
df.loc[2,["OrderDate"]]

OrderDate    1996-09-20
Name: 2, dtype: object

In [57]:
df.iloc[2,3]

'1996-09-20'

In [58]:
df.loc[[1,2],"OrderDate"]

1    1996-09-19
2    1996-09-20
Name: OrderDate, dtype: object

In [60]:
df.loc[[1,2],["OrderDate","EmployeeID"]]

    OrderDate  EmployeeID
1  1996-09-19           3
2  1996-09-20           8

In [61]:
df.iloc[[1,2],[2,3]]

   EmployeeID   OrderDate
1           3  1996-09-19
2           8  1996-09-20

In [64]:
df.loc[:,"OrderDate"]

0    1996-09-18
1    1996-09-19
2    1996-09-20
Name: OrderDate, dtype: object

In [65]:
df.loc[:,["OrderDate","EmployeeID"]]

    OrderDate  EmployeeID
0  1996-09-18           7
1  1996-09-19           3
2  1996-09-20           8

In [67]:
df.iloc[:,2:4]

   EmployeeID   OrderDate
0           7  1996-09-18
1           3  1996-09-19
2           8  1996-09-20

In [68]:
df.loc[0,:]

OrderID            10308
CustomerID             2
EmployeeID             7
OrderDate     1996-09-18
ShipperID              3
Name: 0, dtype: object